/*
Задача:

Да направим ново репо (repository) в GitHub. Правим и нов локален проект на нашия компютър и добавяме новото GitHub репо като remote.
След това, в нашия проект искаме да игнорираме node_modules и .idea папките.
Направете нов файл в който да има четири функции - една за събиране, една за изваждане, една за умножение и една за деление. Приемаме, че всяка една от тези функции ще получава точно 2 аргумента и също приемаме, че тези аргументи винаги ще бъдат подавани като Number (въпреки това може да помислите дали да не направите някакви sanity checks - може да го обсъдим).
Commit-ваме всичко направено до тук.
След това правим два масива в същия файл. Нека и двата масива да са запълнени с произволни числа (и нека също така да има еднакъв брой числа в масивите).
Commit-ваме всичко направено до тук.
След това правим малък тест на четирите функции - искаме да вземем по едно число от всеки масив (със съвпадащи индекси т.е. вземаме първото число от единия масив, заедно с първото число от втория масив и т.н.) и подаваме тези две числа като аргумент на всяка от четирите функции, принтирайки резултата в конзолата.
Commit-ваме всичко направено до тук.
 */

function addFunc(a:number,b:number){
    return a+b
}

function subFunc(a:number,b:number){
    return a-b
}

function mulFunc(a:number,b:number){
    return a*b
}

function divFunc(a:number,b:number){
    return a/b
}

console.log(addFunc(5,4));
console.log(subFunc(5,4));
console.log(mulFunc(5,4));
console.log(divFunc(10,5));
console.log(" ");
let array1= [2,9,6,1,15];
let array2= [3,8,9,10,20];

console.log(addFunc(array1[2],array1[4]));
console.log(subFunc(array2[4],array2[1]));
console.log(mulFunc(array2[3],array1[4]));
console.log(divFunc(array1[4],array2[0]));